ba-backend/app/controllers/flights_controller.rb

  def index
    headers['Access-Control-Allow-Origin'] = '*'
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"

  def show
    @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]