ba-backend/app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    # raise "hell"
    @reservation = Reservation.find params[:id]

UPDATE "reservations" SET "seat" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["seat", 15], ["updated_at", "2020-01-29 10:28:13.392862"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @reservation.update(reservation_params)